app/Controllers/PlanController.php

SELECT *
FROM `plans`
WHERE `user_id` = '1'
SELECT *
FROM `plan_users`
WHERE `plan_id` = '19'
SELECT *
FROM `users`
WHERE `users`.`id` = '4'
SELECT `plans`.*, `plan_users`.`is_owner`
FROM `plan_users`
JOIN `plans` ON `plans`.`id` = `plan_users`.`plan_id`
WHERE `plan_users`.`user_id` = '1'
AND `plans`.`user_id` != '1'
---
    public function index()
    {
        $planModel = new PlanModel();
        $planUserModel = new PlanUserModel();
        $userModel = new UserModel();

        // Periksa apakah pengguna sudah login
        $isLoggedIn = session()->get('isLoggedIn');
        $userName = session()->get('name');
        $userId = session()->get('id');

        // Mengambil rencana yang dimiliki oleh user
        $yourPlans = $planModel->where('user_id', $userId)->findAll();

        // Menambahkan data shared_users ke $yourPlans
        foreach ($yourPlans as &$plan) {
            $sharedUsers = $planUserModel->where('plan_id', $plan['id'])->findAll();
            $plan['shared_users'] = [];
            foreach ($sharedUsers as $sharedUser) {
                $user = $userModel->find($sharedUser['user_id']);
                if ($user) {
                    $plan['shared_users'][] = $user['email'];
                }
            }
        }

        // Mengambil rencana yang dibagikan kepada user
        $sharedPlans = $planUserModel
        ->select('plans.*, plan_users.is_owner')
        ->join('plans', 'plans.id = plan_users.plan_id')
        ->where('plan_users.user_id', $userId)
        ->where('plans.user_id !=', $userId)
        ->findAll();

SELECT *
FROM `plan_users`
WHERE `plan_id` = '21'
SELECT *
FROM `users`
WHERE `users`.`id` = '1'
---
        $plansSharedToYou = [];
        foreach ($sharedPlans as $sharedPlan) {
            // Menambahkan data shared_users
            $sharedUsers = $planUserModel->where('plan_id', $sharedPlan['id'])->findAll();
            $sharedPlan['shared_users'] = [];
            foreach ($sharedUsers as $sharedUser) {
                $user = $userModel->find($sharedUser['user_id']);

INSERT INTO `plans` (`user_id`, `destination`, `start_date`, `end_date`, `activities`, `created_at`, `updated_at`) VALUES ('7', 'med', '2025-01-24', '2025-01-29', 'yey', '2025-01-06 08:54:05', '2025-01-06 08:54:05')
---
            $planModel = new PlanModel();

            try {
                if ($planModel->save($data)) {

SELECT *
FROM `plans`
WHERE `plans`.`id` = '22'
---
    public function edit($id)
    {
        $planModel = new PlanModel();
        $plan = $planModel->find($id);

SELECT *
FROM `plans`
WHERE `plans`.`id` = '22'
---
    public function update($id)
    {
        log_message('debug', '>>> Update method called for ID: ' . $id);
        log_message('debug', 'Request Method: ' . $this->request->getMethod());

        if ($this->request->getMethod() === 'POST' && $this->request->getPost()) {
            $planModel = new PlanModel();

            $existingPlan = $planModel->find($id);

UPDATE `plans` SET `destination` = 'Hahahah', `start_date` = '2025-01-15', `end_date` = '2025-01-29', `activities` = 'Yeyss', `updated_at` = '2025-01-06 08:53:42'
WHERE `plans`.`id` IN ('22')
---
            log_message('debug', 'Data prepared for updating: ' . print_r($data, true));

            try {
                if ($planModel->update($id, $data)) {

SELECT *
FROM `users`
WHERE `email` = 'taralubis12@gmail.com'
 LIMIT 1
SELECT *
FROM `plans`
WHERE `plans`.`id` = '23'
---
    public function addUserToPlan($planId)
    {
        log_message('debug', '>>> Add User to Plan called for Plan ID: ' . $planId);

        $planModel = new PlanModel();
        $plan = $planModel->find($planId);
        if (!$plan || $plan['user_id'] !== session()->get('id')) {
            return redirect()->to('/plans')->with('error', 'You are not authorized to modify this plan.');
        }

        $email = $this->request->getPost('email');
        if (!$email) {
            return redirect()->back()->with('error', 'Email is required.');
        }

        $userModel = new UserModel();
        $user = $userModel->where('email', $email)->first();
        if (!$user) {
            return redirect()->back()->with('error', 'User with the provided email does not exist.');
        }

        if ($user['id'] === session()->get('id')) {
            return redirect()->back()->with('error', 'You cannot add yourself to the plan.');

SELECT *
FROM `plan_users`
WHERE `plan_id` = '23'
AND `user_id` = '1'
 LIMIT 1
---

        try {
            $planUserModel->save($data);
            return redirect()->to('/plans')->with('success', 'User added to the plan successfully.');

SELECT *
FROM `plans`
WHERE `plans`.`id` = '22'
SELECT *
FROM `users`
WHERE `email` = '18222026@mahasiswa.itb.ac.id'
 LIMIT 1
---
    public function removeUserFromPlan($planId, $userEmail)
    {
        log_message('debug', '>>> Remove User from Plan called for Plan ID: ' . $planId . ' and User Email: ' . $userEmail);

        $planModel = new PlanModel();
        $plan = $planModel->find($planId);
        if (!$plan || $plan['user_id'] !== session()->get('id')) {
            return redirect()->to('/plans')->with('error', 'You are not authorized to modify this plan.');
        }

        $userModel = new UserModel();
        $user = $userModel->where('email', $userEmail)->first();
        if (!$user) {
            return redirect()->to('/plans')->with('error', 'User with the provided email does not exist.');
        }

        $planUserModel = new PlanUserModel();
        $userPlan = $planUserModel->where(['plan_id' => $planId, 'user_id' => $user['id']])->first();
        if (!$userPlan) {
            return redirect()->to('/plans')->with('error', 'User is not part of this plan.');
        }

        try {
            $planUserModel->delete($userPlan['id']);
            return redirect()->to('/plans')->with('success', 'User removed from the plan successfully.');
        } catch (\Exception $e) {
            log_message('error', 'Error removing user from plan: ' . $e->getMessage());
            return redirect()->back()->with('error', 'An error occurred while removing the user.');